thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
/***************************************************************************//**
 * @file  zap-cli.c
 * @brief Generated file for zcl cli using ZAP. Do not update file manually.
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#ifdef SL_COMPONENT_CATALOG_PRESENT
#include "sl_component_catalog.h"
#endif

#ifdef SL_CATALOG_ZIGBEE_ZCL_CLI_PRESENT

#include <stdlib.h>
#include "sl_cli_config.h"
#include "sl_cli_command.h"
#include "sl_cli.h"
#include "zcl-cli.h"
#ifdef SL_CATALOG_ZIGBEE_DEBUG_PRINT_PRESENT
#include "sl_zigbee_debug_print.h"
#endif // SL_CATALOG_ZIGBEE_DEBUG_PRINT_PRESENT
#include "zap-type.h"
#include "zap-id.h"
#include "af.h"
#include "zap-config.h"

extern void sli_zigbee_zcl_simple_command(uint8_t frameControl,
                        uint16_t clusterId,
                        uint8_t commandId,
                        sl_cli_command_arg_t *arguments,
                        uint8_t *argumentTypes);
extern sl_cli_command_info_t cli_cmd_zcl_global_group;
extern sl_cli_command_info_t cli_cmd_zcl_mfg_code_command;
extern sl_cli_command_info_t cli_cmd_zcl_time_command;
extern sl_cli_command_info_t cli_cmd_zcl_use_next_sequence_command;
extern sl_cli_command_info_t cli_cmd_zcl_x_default_resp_command;
extern sl_cli_command_info_t cli_cmd_zcl_test_response_on_command;
extern sl_cli_command_info_t cli_cmd_zcl_test_response_off_command;
#if defined(ZCL_USING_IDENTIFY_CLUSTER_SERVER) || defined(ZCL_USING_IDENTIFY_CLUSTER_CLIENT)
extern sl_cli_command_info_t cli_cmd_zcl_identify_on_command;
extern sl_cli_command_info_t cli_cmd_zcl_identify_off_command;
#endif
#if defined(ZCL_USING_BACNET_PROTOCOL_TUNNEL_CLUSTER_CLIENT) || defined(ZCL_USING_BACNET_PROTOCOL_TUNNEL_CLUSTER_SERVER)
extern sl_cli_command_info_t cli_cmd_zcl_bacnet_transfer_whois_command;
#endif
#if defined(ZCL_USING_TUNNELING_CLUSTER_CLIENT) || defined(ZCL_USING_TUNNELING_CLUSTER_SERVER)
extern sl_cli_command_info_t cli_cmd_zcl_tunneling_random_to_server_command;
extern sl_cli_command_info_t cli_cmd_zcl_tunneling_transfer_to_server_command;
extern sl_cli_command_info_t cli_cmd_zcl_tunneling_random_to_client_command;
extern sl_cli_command_info_t cli_cmd_zcl_tunneling_transfer_to_client_command;
#endif

#ifdef __cplusplus
extern "C" {
#endif

// Provide function declarations
void sli_zigbee_cli_zcl_groups_add_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_groups_add_if_id_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_add_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_chg_supply_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_loop_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_cfg_mirror_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_cfg_nft_flags_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_cfg_nft_scheme_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_copy_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_identify_ez_mode_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_power_profile_energy_phases_schedule_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_power_profile_energy_phases_schedule_states_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_eadd_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_emovehue_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_emovetohue_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_emovetohueandsat_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_estephue_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_eview_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_poll_control_stop_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_groups_get_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_get_ntfy_msg_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_get_profile_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_get_sampled_data_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_get_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_get_snapshot_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_identify_id_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_identify_query_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_local_chg_supply_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_mirror_removed_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_level_control_move_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_movecolor_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_movecolortemp_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_movehue_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_movesat_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_movetocolor_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_movetocolortemp_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_movetohue_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_movetohueandsat_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_level_control_mv_to_level_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_level_control_o_mv_to_level_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_movetosat_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_level_control_o_move_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_on_off_off_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_on_off_offeffect_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_on_off_on_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_on_off_onrecall_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_on_off_ontimedoff_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_power_profile_profile_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_power_profile_schedule_constraints_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_power_profile_state_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_pub_ss_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_recall_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_groups_rmall_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_rmall_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_groups_remove_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_remove_mirror_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_remove_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_req_fast_poll_mode_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_request_mirror_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_rst_load_limit_ctr_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_basic_rtfd_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_sch_snapshot_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_sch_snapshot_resp_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_poll_control_long_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_poll_control_short_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_set_supply_status_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_set_uncntrl_flow_threshold_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_start_sampling_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_start_samp_rsp_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_level_control_step_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_stepcolor_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_stepcolortemp_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_stephue_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_stepsat_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_level_control_o_step_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_level_control_stop_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_color_control_stopmovestep_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_level_control_o_stop_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_store_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_sup_stat_rsp_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_take_snapshot_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_simple_metering_take_snapshot_resp_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_on_off_toggle_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_identify_trigger_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_groups_view_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_scenes_view_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_ias_zone_enroll_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_zcl_ias_zone_sc_command(sl_cli_command_arg_t *arguments);

// Command structs. Names are command names prefixed by cli_cmd_zcl_[cluster name]_cluster
static const sl_cli_command_info_t cli_cmd_zcl_groups_cluster_add_group = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_groups_add_command,
            "Command description for AddGroup",
            "group id" SL_CLI_UNIT_SEPARATOR "group name" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_STRING,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_groups_cluster_add_group_if_identifying = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_groups_add_if_id_command,
            "Command description for AddGroupIfIdentifying",
            "group id" SL_CLI_UNIT_SEPARATOR "group name" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_STRING,
                SL_CLI_ARG_END,
            });

