thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_add_scene = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_add_command,
            "Add a scene to the scene table. Extension field sets are supported, and are inputed as arrays of the form [[cluster ID] [length] [value0...n] ...]",
            "group id" SL_CLI_UNIT_SEPARATOR "scene id" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "scene name" SL_CLI_UNIT_SEPARATOR "extension field sets" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_STRING,
                SL_CLI_ARG_HEXOPT,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_change_supply = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_chg_supply_command,
            "This command is sent from the Head-end or ESI to the Metering Device to instruct it to change the status of the valve or load switch, i.e. the supply.",
            "provider id" SL_CLI_UNIT_SEPARATOR "issuer event id" SL_CLI_UNIT_SEPARATOR "request date time" SL_CLI_UNIT_SEPARATOR "implementation date time" SL_CLI_UNIT_SEPARATOR "proposed supply status" SL_CLI_UNIT_SEPARATOR "supply control bits" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_color_loop_set = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_loop_command,
            "Command description for ColorLoopSet",
            "update flags" SL_CLI_UNIT_SEPARATOR "action" SL_CLI_UNIT_SEPARATOR "direction" SL_CLI_UNIT_SEPARATOR "time" SL_CLI_UNIT_SEPARATOR "start hue" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_configure_mirror = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_cfg_mirror_command,
            "ConfigureMirror is sent to the mirror once the mirror has been created. The command deals with the operational configuration of the Mirror.",
            "issuer event id" SL_CLI_UNIT_SEPARATOR "reporting interval" SL_CLI_UNIT_SEPARATOR "mirror notification reporting" SL_CLI_UNIT_SEPARATOR "notification scheme" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_configure_notification_flags = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_cfg_nft_flags_command,
            "The ConfigureNotificationFlags command is used to set the commands relating to the bit value for each NotificationFlags attribute that the scheme is proposing to use.",
            "issuer event id" SL_CLI_UNIT_SEPARATOR "notification scheme" SL_CLI_UNIT_SEPARATOR "notification flag attribute id" SL_CLI_UNIT_SEPARATOR "cluster id" SL_CLI_UNIT_SEPARATOR "manufacturer code" SL_CLI_UNIT_SEPARATOR "number of commands" SL_CLI_UNIT_SEPARATOR "command ids" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8OPT,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_configure_notification_scheme = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_cfg_nft_scheme_command,
            "The ConfigureNotificationScheme is sent to the mirror once the mirror has been created. The command deals with the operational configuration of the Mirror and the device that reports to the mirror. No default schemes are allowed to be overwritten.",
            "issuer event id" SL_CLI_UNIT_SEPARATOR "notification scheme" SL_CLI_UNIT_SEPARATOR "notification flag order" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_copy_scene = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_copy_command,
            "Command description for CopyScene",
            "mode" SL_CLI_UNIT_SEPARATOR "group id from" SL_CLI_UNIT_SEPARATOR "scene id from" SL_CLI_UNIT_SEPARATOR "group id to" SL_CLI_UNIT_SEPARATOR "scene id to" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_identify_cluster_ez_mode_invoke = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_identify_ez_mode_command,
            "Invoke EZMode on an Identify Server",
            "action" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_power_profile_cluster_energy_phases_schedule_notification = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_power_profile_energy_phases_schedule_command,
            "The EnergyPhasesScheduleNotification Command is generated by a device supporting the client side of the Power Profile cluster in order to schedule the start of the selected Power Profile and its phases.",
            "power profile id" SL_CLI_UNIT_SEPARATOR "num of scheduled phases" SL_CLI_UNIT_SEPARATOR "scheduled phases" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_HEXOPT,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_power_profile_cluster_energy_phases_schedule_state_request = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_power_profile_energy_phases_schedule_states_command,
            "The EnergyPhasesScheduleStateRequest  Command is generated by a device supporting the client side of the Power Profile cluster to check the states of the scheduling of a power profile, which is supported in the device implementing the server side of Power Profile cluster.",
            "power profile id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_enhanced_add_scene = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_eadd_command,
            "Command description for EnhancedAddScene",
            "group id" SL_CLI_UNIT_SEPARATOR "scene id" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "scene name" SL_CLI_UNIT_SEPARATOR "extension field sets" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_STRING,
                SL_CLI_ARG_HEXOPT,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_enhanced_move_hue = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_emovehue_command,
            "Command description for EnhancedMoveHue",
            "move mode" SL_CLI_UNIT_SEPARATOR "rate" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

