thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_enhanced_move_to_hue = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_emovetohue_command,
            "Command description for EnhancedMoveToHue",
            "enhanced hue" SL_CLI_UNIT_SEPARATOR "direction" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_enhanced_move_to_hue_and_saturation = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_emovetohueandsat_command,
            "Command description for EnhancedMoveToHueAndSaturation",
            "enhanced hue" SL_CLI_UNIT_SEPARATOR "saturation" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_enhanced_step_hue = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_estephue_command,
            "Command description for EnhancedStepHue",
            "step mode" SL_CLI_UNIT_SEPARATOR "step size" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_enhanced_view_scene = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_eview_command,
            "Command description for EnhancedViewScene",
            "group id" SL_CLI_UNIT_SEPARATOR "scene id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_poll_control_cluster_fast_poll_stop = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_poll_control_stop_command,
            "The Fast Poll Stop command is used to stop the fast poll mode initiated by the Check-in response.",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_groups_cluster_get_group_membership = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_groups_get_command,
            "Command description for GetGroupMembership",
            "group count" SL_CLI_UNIT_SEPARATOR "group list" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16OPT,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_get_notified_message = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_get_ntfy_msg_command,
            "The GetNotifiedMessage command is used only when a BOMD is being mirrored. This command provides a method for the BOMD to notify the Mirror message queue that it wants to receive commands that the Mirror has queued. The Notification flags set within the command shall inform the mirror of the commands that the BOMD is requesting.",
            "notification scheme" SL_CLI_UNIT_SEPARATOR "notification flag attribute id" SL_CLI_UNIT_SEPARATOR "notification flagsn" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_get_profile = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_get_profile_command,
            "The GetProfile command is generated when a client device wishes to retrieve a list of captured Energy, Gas or water consumption for profiling purposes.",
            "interval channel" SL_CLI_UNIT_SEPARATOR "end time" SL_CLI_UNIT_SEPARATOR "number of periods" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_get_sampled_data = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_get_sampled_data_command,
            "This command is used to request sampled data from the server. Note that it is the responsibility of the client to ensure that it does not request more samples than can be held in a single command payload.",
            "sample id" SL_CLI_UNIT_SEPARATOR "earliest sample time" SL_CLI_UNIT_SEPARATOR "sample type" SL_CLI_UNIT_SEPARATOR "number of samples" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_get_scene_membership = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_get_command,
            "Command description for GetSceneMembership",
            "group id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_get_snapshot = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_get_snapshot_command,
            "This command is used to request snapshot data from the cluster server.",
            "earliest start time" SL_CLI_UNIT_SEPARATOR "latest end time" SL_CLI_UNIT_SEPARATOR "snapshot offset" SL_CLI_UNIT_SEPARATOR "snapshot cause" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_identify_cluster_identify = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_identify_id_command,
            "Command description for Identify",
            "identify time" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

