thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
static const sl_cli_command_info_t cli_cmd_zcl_identify_cluster_identify_query = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_identify_query_command,
            "Command description for IdentifyQuery",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_local_change_supply = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_local_chg_supply_command,
            "This command is a simplified version of the ChangeSupply command, intended to be sent from an IHD to a meter as the consequence of a user action on the IHD. Its purpose is to provide a local disconnection/reconnection button on the IHD in addition to the one on the meter.",
            "proposed supply status" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_mirror_removed = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_mirror_removed_command,
            "The Mirror Removed Command allows the ESI to inform a sleepy Metering Device mirroring support has been removed or halted.",
            "endpoint id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_level_control_cluster_move = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_level_control_move_command,
            "Command description for Move",
            "move mode" SL_CLI_UNIT_SEPARATOR "rate" SL_CLI_UNIT_SEPARATOR "option mask" SL_CLI_UNIT_SEPARATOR "option override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_move_color = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_movecolor_command,
            "Moves the color.",
            "ratex" SL_CLI_UNIT_SEPARATOR "ratey" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_INT16,
                SL_CLI_ARG_INT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_move_color_temperature = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_movecolortemp_command,
            "Command description for MoveColorTemperature",
            "move mode" SL_CLI_UNIT_SEPARATOR "rate" SL_CLI_UNIT_SEPARATOR "color temperature minimum" SL_CLI_UNIT_SEPARATOR "color temperature maximum" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_move_hue = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_movehue_command,
            "Move hue up or down at specified rate.",
            "move mode" SL_CLI_UNIT_SEPARATOR "rate" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_move_saturation = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_movesat_command,
            "Move saturation up or down at specified rate.",
            "move mode" SL_CLI_UNIT_SEPARATOR "rate" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_move_to_color = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_movetocolor_command,
            "Move to specified color.",
            "colorx" SL_CLI_UNIT_SEPARATOR "colory" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_move_to_color_temperature = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_movetocolortemp_command,
            "Move to a specific color temperature.",
            "color temperature" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_move_to_hue = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_movetohue_command,
            "Move to specified hue.",
            "hue" SL_CLI_UNIT_SEPARATOR "direction" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

