thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_move_to_hue_and_saturation = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_movetohueandsat_command,
            "Move to hue and saturation.",
            "hue" SL_CLI_UNIT_SEPARATOR "saturation" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_level_control_cluster_move_to_level = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_level_control_mv_to_level_command,
            "Command description for MoveToLevel",
            "level" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "option mask" SL_CLI_UNIT_SEPARATOR "option override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_level_control_cluster_move_to_level_with_on_off = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_level_control_o_mv_to_level_command,
            "Command description for MoveToLevelWithOnOff",
            "level" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_move_to_saturation = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_movetosat_command,
            "Move to specified saturation.",
            "saturation" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_level_control_cluster_move_with_on_off = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_level_control_o_move_command,
            "Command description for MoveWithOnOff",
            "move mode" SL_CLI_UNIT_SEPARATOR "rate" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_on_off_cluster_off = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_on_off_off_command,
            "Command description for Off",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_on_off_cluster_off_with_effect = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_on_off_offeffect_command,
            "Command description for OffWithEffect",
            "effect id" SL_CLI_UNIT_SEPARATOR "effect variant" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_on_off_cluster_on = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_on_off_on_command,
            "Command description for On",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_on_off_cluster_on_with_recall_global_scene = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_on_off_onrecall_command,
            "Command description for OnWithRecallGlobalScene",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_on_off_cluster_on_with_timed_off = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_on_off_ontimedoff_command,
            "Command description for OnWithTimedOff",
            "on off control" SL_CLI_UNIT_SEPARATOR "on time" SL_CLI_UNIT_SEPARATOR "off wait time" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_power_profile_cluster_power_profile_request = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_power_profile_profile_command,
            "The PowerProfileRequest Command is generated by a device supporting the client side of the Power Profile cluster in order to request the Power Profile of a server device.",
            "power profile id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_power_profile_cluster_power_profile_schedule_constraints_request = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_power_profile_schedule_constraints_command,
            "The PowerProfileScheduleConstraintsRequest Command is generated by a device supporting the client side of the Power Profile cluster in order to request the constraints -if set- of Power Profile of a client device, in order to set the proper boundaries for the scheduling when calculating the schedules.",
            "power profile id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_power_profile_cluster_power_profile_state_request = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_power_profile_state_command,
            "The PowerProfileStateRequest Command is generated in order to retrieve the identifiers of current Power Profiles.",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_publish_snapshot = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_pub_ss_command,
            "This command is generated in response to a GetSnapshot command. It is used to return a single snapshot to the client.",
            "snapshot id" SL_CLI_UNIT_SEPARATOR "snapshot time" SL_CLI_UNIT_SEPARATOR "total snapshots found" SL_CLI_UNIT_SEPARATOR "command index" SL_CLI_UNIT_SEPARATOR "total commands" SL_CLI_UNIT_SEPARATOR "snapshot cause" SL_CLI_UNIT_SEPARATOR "snapshot payload type" SL_CLI_UNIT_SEPARATOR "snapshot payload" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8OPT,
                SL_CLI_ARG_END,
            });

