thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_recall_scene = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_recall_command,
            "Command description for RecallScene",
            "group id" SL_CLI_UNIT_SEPARATOR "scene id" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_groups_cluster_remove_all_groups = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_groups_rmall_command,
            "Command description for RemoveAllGroups",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_remove_all_scenes = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_rmall_command,
            "Command description for RemoveAllScenes",
            "group id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_groups_cluster_remove_group = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_groups_remove_command,
            "Command description for RemoveGroup",
            "group id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_remove_mirror = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_remove_mirror_command,
            "This command is used to request the ESI to remove its mirror of Metering Device data.",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_remove_scene = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_remove_command,
            "Command description for RemoveScene",
            "group id" SL_CLI_UNIT_SEPARATOR "scene id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_request_fast_poll_mode = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_req_fast_poll_mode_command,
            "The Request Fast Poll Mode command is generated when the metering client wishes to receive near real-time updates of InstantaneousDemand.",
            "fast poll update period" SL_CLI_UNIT_SEPARATOR "duration" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_request_mirror = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_request_mirror_command,
            "This command is used to request the ESI to mirror Metering Device data.",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_reset_load_limit_counter = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_rst_load_limit_ctr_command,
            "The ResetLoadLimitCounter command shall cause the LoadLimitCounter attribute to be reset.",
            "provider id" SL_CLI_UNIT_SEPARATOR "issuer event id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_basic_cluster_reset_to_factory_defaults = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_basic_rtfd_command,
            "Command that resets all attribute values to factory default.",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_schedule_snapshot = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_sch_snapshot_command,
            "This command is used to set up a schedule of when the device shall create snapshot data.",
            "issuer event id" SL_CLI_UNIT_SEPARATOR "command index" SL_CLI_UNIT_SEPARATOR "command count" SL_CLI_UNIT_SEPARATOR "snapshot schedule payload" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_HEXOPT,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_schedule_snapshot_response = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_sch_snapshot_resp_command,
            "This command is generated in response to a ScheduleSnapshot command, and is sent to confirm whether the requested snapshot schedule has been set up.",
            "issuer event id" SL_CLI_UNIT_SEPARATOR "snapshot response payload" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_HEXOPT,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_poll_control_cluster_set_long_poll_interval = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_poll_control_long_command,
            "The Set Long Poll Interval command is used to set the read only Long Poll Interval Attribute.",
            "new long poll interval" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_poll_control_cluster_set_short_poll_interval = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_poll_control_short_command,
            "The Set Short Poll Interval command is used to set the read only Short Poll Interval Attribute.",
            "new short poll interval" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_set_supply_status = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_set_supply_status_command,
            "This command is used to specify the required status of the supply following the occurance of certain events on the meter.",
            "issuer event id" SL_CLI_UNIT_SEPARATOR "supply tamper state" SL_CLI_UNIT_SEPARATOR "supply depletion state" SL_CLI_UNIT_SEPARATOR "supply uncontrolled flow state" SL_CLI_UNIT_SEPARATOR "load limit supply state" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

