thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_set_uncontrolled_flow_threshold = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_set_uncntrl_flow_threshold_command,
            "This command is used to update the 'Uncontrolled Flow Rate' configuration data used by flow meters.",
            "provider id" SL_CLI_UNIT_SEPARATOR "issuer event id" SL_CLI_UNIT_SEPARATOR "uncontrolled flow threshold" SL_CLI_UNIT_SEPARATOR "unit of measure" SL_CLI_UNIT_SEPARATOR "multiplier" SL_CLI_UNIT_SEPARATOR "divisor" SL_CLI_UNIT_SEPARATOR "stabilisation period" SL_CLI_UNIT_SEPARATOR "measurement period" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_start_sampling = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_start_sampling_command,
            "The sampling mechanism allows a set of samples of the specified type of data to be taken, commencing at the stipulated start time. This mechanism may run concurrently with the capturing of profile data, and may refer the same parameters, albeit possibly at a different sampling rate.",
            "issuer event id" SL_CLI_UNIT_SEPARATOR "start sampling time" SL_CLI_UNIT_SEPARATOR "sample type" SL_CLI_UNIT_SEPARATOR "sample request interval" SL_CLI_UNIT_SEPARATOR "max number of samples" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_start_sampling_response = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_start_samp_rsp_command,
            "This command is transmitted by a Metering Device in response to a StartSampling command.",
            "sample id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_level_control_cluster_step = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_level_control_step_command,
            "Command description for Step",
            "step mode" SL_CLI_UNIT_SEPARATOR "step size" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "option mask" SL_CLI_UNIT_SEPARATOR "option override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_step_color = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_stepcolor_command,
            "Steps the lighting to a specific color.",
            "stepx" SL_CLI_UNIT_SEPARATOR "stepy" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_INT16,
                SL_CLI_ARG_INT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_step_color_temperature = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_stepcolortemp_command,
            "Command description for StepColorTemperature",
            "step mode" SL_CLI_UNIT_SEPARATOR "step size" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "color temperature minimum" SL_CLI_UNIT_SEPARATOR "color temperature maximum" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_step_hue = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_stephue_command,
            "Step hue up or down by specified size at specified rate.",
            "step mode" SL_CLI_UNIT_SEPARATOR "step size" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_step_saturation = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_stepsat_command,
            "Step saturation up or down by specified size at specified rate.",
            "step mode" SL_CLI_UNIT_SEPARATOR "step size" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_level_control_cluster_step_with_on_off = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_level_control_o_step_command,
            "Command description for StepWithOnOff",
            "step mode" SL_CLI_UNIT_SEPARATOR "step size" SL_CLI_UNIT_SEPARATOR "transition time" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_level_control_cluster_stop = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_level_control_stop_command,
            "Command description for Stop",
            "option mask" SL_CLI_UNIT_SEPARATOR "option override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_color_control_cluster_stop_move_step = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_color_control_stopmovestep_command,
            "Command description for StopMoveStep",
            "options mask" SL_CLI_UNIT_SEPARATOR "options override" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_level_control_cluster_stop_with_on_off = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_level_control_o_stop_command,
            "Command description for StopWithOnOff",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_store_scene = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_store_command,
            "Command description for StoreScene",
            "group id" SL_CLI_UNIT_SEPARATOR "scene id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_supply_status_response = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_sup_stat_rsp_command,
            "This command is transmitted by a Metering Device in response to a ChangeSupply command.",
            "provider id" SL_CLI_UNIT_SEPARATOR "issuer event id" SL_CLI_UNIT_SEPARATOR "implementation date time" SL_CLI_UNIT_SEPARATOR "supply status" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

