thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_take_snapshot = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_take_snapshot_command,
            "This command is used to instruct the cluster server to take a single snapshot.",
            "snapshot cause" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_simple_metering_cluster_take_snapshot_response = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_simple_metering_take_snapshot_resp_command,
            "This command is generated in response to a TakeSnapshot command, and is sent to confirm whether the requested snapshot has been accepted and successfully taken.",
            "snapshot id" SL_CLI_UNIT_SEPARATOR "snapshot confirmation" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT32,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_on_off_cluster_toggle = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_on_off_toggle_command,
            "Command description for Toggle",
            "",
            {
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_identify_cluster_trigger_effect = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_identify_trigger_command,
            "Command description for TriggerEffect",
            "effect id" SL_CLI_UNIT_SEPARATOR "effect variant" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_groups_cluster_view_group = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_groups_view_command,
            "Command description for ViewGroup",
            "group id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_scenes_cluster_view_scene = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_scenes_view_command,
            "Command description for ViewScene",
            "group id" SL_CLI_UNIT_SEPARATOR "scene id" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_ias_zone_cluster_zone_enroll_request = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_ias_zone_enroll_command,
            "Command description for zoneEnrollRequest",
            "zone type" SL_CLI_UNIT_SEPARATOR "manufacturer code" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });

static const sl_cli_command_info_t cli_cmd_zcl_ias_zone_cluster_zone_status_change_notification = \
SL_CLI_COMMAND(sli_zigbee_cli_zcl_ias_zone_sc_command,
            "Command description for zoneStatusChangeNotification",
            "zone status" SL_CLI_UNIT_SEPARATOR "extended status" SL_CLI_UNIT_SEPARATOR "zone id" SL_CLI_UNIT_SEPARATOR "delay" SL_CLI_UNIT_SEPARATOR ,
            {
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT8,
                SL_CLI_ARG_UINT16,
                SL_CLI_ARG_END,
            });


// Create group command tables and structs if cli_groups given
// in template. Group name is suffixed with [cluster name]_[cluster_side]_cluster_group_table for tables
// and group commands are cli_cmd_( group name )_group
static const sl_cli_command_entry_t zcl_basic_cluster_command_table[] = {
    { "rtfd", &cli_cmd_zcl_basic_cluster_reset_to_factory_defaults, false },
    { NULL, NULL, false },
};
static const sl_cli_command_entry_t zcl_color_control_cluster_command_table[] = {
    { "movetohue", &cli_cmd_zcl_color_control_cluster_move_to_hue, false },
    { "movehue", &cli_cmd_zcl_color_control_cluster_move_hue, false },
    { "stephue", &cli_cmd_zcl_color_control_cluster_step_hue, false },
    { "movetosat", &cli_cmd_zcl_color_control_cluster_move_to_saturation, false },
    { "movesat", &cli_cmd_zcl_color_control_cluster_move_saturation, false },
    { "stepsat", &cli_cmd_zcl_color_control_cluster_step_saturation, false },
    { "movetohueandsat", &cli_cmd_zcl_color_control_cluster_move_to_hue_and_saturation, false },
    { "movetocolor", &cli_cmd_zcl_color_control_cluster_move_to_color, false },
    { "movecolor", &cli_cmd_zcl_color_control_cluster_move_color, false },
    { "stepcolor", &cli_cmd_zcl_color_control_cluster_step_color, false },
    { "movetocolortemp", &cli_cmd_zcl_color_control_cluster_move_to_color_temperature, false },
    { "emovetohue", &cli_cmd_zcl_color_control_cluster_enhanced_move_to_hue, false },
    { "emovehue", &cli_cmd_zcl_color_control_cluster_enhanced_move_hue, false },
    { "estephue", &cli_cmd_zcl_color_control_cluster_enhanced_step_hue, false },
    { "emovetohueandsat", &cli_cmd_zcl_color_control_cluster_enhanced_move_to_hue_and_saturation, false },
    { "loop", &cli_cmd_zcl_color_control_cluster_color_loop_set, false },
    { "stopmovestep", &cli_cmd_zcl_color_control_cluster_stop_move_step, false },
    { "movecolortemp", &cli_cmd_zcl_color_control_cluster_move_color_temperature, false },
    { "stepcolortemp", &cli_cmd_zcl_color_control_cluster_step_color_temperature, false },
    { NULL, NULL, false },
};
static const sl_cli_command_entry_t zcl_groups_cluster_command_table[] = {
    { "add", &cli_cmd_zcl_groups_cluster_add_group, false },
    { "view", &cli_cmd_zcl_groups_cluster_view_group, false },
    { "get", &cli_cmd_zcl_groups_cluster_get_group_membership, false },
    { "remove", &cli_cmd_zcl_groups_cluster_remove_group, false },
    { "rmall", &cli_cmd_zcl_groups_cluster_remove_all_groups, false },
    { "add-if-id", &cli_cmd_zcl_groups_cluster_add_group_if_identifying, false },
    { NULL, NULL, false },
};
static const sl_cli_command_entry_t zcl_ias_zone_cluster_command_table[] = {
    { "sc", &cli_cmd_zcl_ias_zone_cluster_zone_status_change_notification, false },
    { "enroll", &cli_cmd_zcl_ias_zone_cluster_zone_enroll_request, false },
    { NULL, NULL, false },
};
