thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
static const sl_cli_command_entry_t zcl_identify_cluster_command_table[] = {
    { "id", &cli_cmd_zcl_identify_cluster_identify, false },
    { "query", &cli_cmd_zcl_identify_cluster_identify_query, false },
    { "ez-mode", &cli_cmd_zcl_identify_cluster_ez_mode_invoke, false },
    { "trigger", &cli_cmd_zcl_identify_cluster_trigger_effect, false },
    { "on", &cli_cmd_zcl_identify_on_command, false},
    { "off", &cli_cmd_zcl_identify_off_command, false},
    { NULL, NULL, false },
};
static const sl_cli_command_entry_t zcl_level_control_cluster_command_table[] = {
    { "mv-to-level", &cli_cmd_zcl_level_control_cluster_move_to_level, false },
    { "move", &cli_cmd_zcl_level_control_cluster_move, false },
    { "step", &cli_cmd_zcl_level_control_cluster_step, false },
    { "stop", &cli_cmd_zcl_level_control_cluster_stop, false },
    { "o-mv-to-level", &cli_cmd_zcl_level_control_cluster_move_to_level_with_on_off, false },
    { "o-move", &cli_cmd_zcl_level_control_cluster_move_with_on_off, false },
    { "o-step", &cli_cmd_zcl_level_control_cluster_step_with_on_off, false },
    { "o-stop", &cli_cmd_zcl_level_control_cluster_stop_with_on_off, false },
    { NULL, NULL, false },
};
static const sl_cli_command_entry_t zcl_on_off_cluster_command_table[] = {
    { "off", &cli_cmd_zcl_on_off_cluster_off, false },
    { "on", &cli_cmd_zcl_on_off_cluster_on, false },
    { "toggle", &cli_cmd_zcl_on_off_cluster_toggle, false },
    { "offeffect", &cli_cmd_zcl_on_off_cluster_off_with_effect, false },
    { "onrecall", &cli_cmd_zcl_on_off_cluster_on_with_recall_global_scene, false },
    { "ontimedoff", &cli_cmd_zcl_on_off_cluster_on_with_timed_off, false },
    { NULL, NULL, false },
};
static const sl_cli_command_entry_t zcl_poll_control_cluster_command_table[] = {
    { "stop", &cli_cmd_zcl_poll_control_cluster_fast_poll_stop, false },
    { "long", &cli_cmd_zcl_poll_control_cluster_set_long_poll_interval, false },
    { "short", &cli_cmd_zcl_poll_control_cluster_set_short_poll_interval, false },
    { NULL, NULL, false },
};
static const sl_cli_command_entry_t zcl_power_profile_cluster_command_table[] = {
    { "profile", &cli_cmd_zcl_power_profile_cluster_power_profile_request, false },
    { "state", &cli_cmd_zcl_power_profile_cluster_power_profile_state_request, false },
    { "energy-phases-schedule", &cli_cmd_zcl_power_profile_cluster_energy_phases_schedule_notification, false },
    { "schedule-constraints", &cli_cmd_zcl_power_profile_cluster_power_profile_schedule_constraints_request, false },
    { "energy-phases-schedule-states", &cli_cmd_zcl_power_profile_cluster_energy_phases_schedule_state_request, false },
    { NULL, NULL, false },
};
static const sl_cli_command_entry_t zcl_scenes_cluster_command_table[] = {
    { "add", &cli_cmd_zcl_scenes_cluster_add_scene, false },
    { "view", &cli_cmd_zcl_scenes_cluster_view_scene, false },
    { "remove", &cli_cmd_zcl_scenes_cluster_remove_scene, false },
    { "rmall", &cli_cmd_zcl_scenes_cluster_remove_all_scenes, false },
    { "store", &cli_cmd_zcl_scenes_cluster_store_scene, false },
    { "recall", &cli_cmd_zcl_scenes_cluster_recall_scene, false },
    { "get", &cli_cmd_zcl_scenes_cluster_get_scene_membership, false },
    { "eadd", &cli_cmd_zcl_scenes_cluster_enhanced_add_scene, false },
    { "eview", &cli_cmd_zcl_scenes_cluster_enhanced_view_scene, false },
    { "copy", &cli_cmd_zcl_scenes_cluster_copy_scene, false },
    { NULL, NULL, false },
};
static const sl_cli_command_entry_t zcl_simple_metering_cluster_command_table[] = {
    { "request-mirror", &cli_cmd_zcl_simple_metering_cluster_request_mirror, false },
    { "remove-mirror", &cli_cmd_zcl_simple_metering_cluster_remove_mirror, false },
    { "sch-snapshot-resp", &cli_cmd_zcl_simple_metering_cluster_schedule_snapshot_response, false },
    { "take-snapshot-resp", &cli_cmd_zcl_simple_metering_cluster_take_snapshot_response, false },
    { "pub-ss", &cli_cmd_zcl_simple_metering_cluster_publish_snapshot, false },
    { "cfg-mirror", &cli_cmd_zcl_simple_metering_cluster_configure_mirror, false },
    { "cfg-nft-scheme", &cli_cmd_zcl_simple_metering_cluster_configure_notification_scheme, false },
    { "cfg-nft-flags", &cli_cmd_zcl_simple_metering_cluster_configure_notification_flags, false },
    { "get-ntfy-msg", &cli_cmd_zcl_simple_metering_cluster_get_notified_message, false },
    { "sup-stat-rsp", &cli_cmd_zcl_simple_metering_cluster_supply_status_response, false },
    { "start-samp-rsp", &cli_cmd_zcl_simple_metering_cluster_start_sampling_response, false },
    { "get-profile", &cli_cmd_zcl_simple_metering_cluster_get_profile, false },
    { "mirror-removed", &cli_cmd_zcl_simple_metering_cluster_mirror_removed, false },
    { "req-fast-poll-mode", &cli_cmd_zcl_simple_metering_cluster_request_fast_poll_mode, false },
    { "sch-snapshot", &cli_cmd_zcl_simple_metering_cluster_schedule_snapshot, false },
    { "take-snapshot", &cli_cmd_zcl_simple_metering_cluster_take_snapshot, false },
    { "get-snapshot", &cli_cmd_zcl_simple_metering_cluster_get_snapshot, false },
    { "start-sampling", &cli_cmd_zcl_simple_metering_cluster_start_sampling, false },
    { "get-sampled-data", &cli_cmd_zcl_simple_metering_cluster_get_sampled_data, false },
    { "rst-load-limit-ctr", &cli_cmd_zcl_simple_metering_cluster_reset_load_limit_counter, false },
    { "chg-supply", &cli_cmd_zcl_simple_metering_cluster_change_supply, false },
    { "local-chg-supply", &cli_cmd_zcl_simple_metering_cluster_local_change_supply, false },
    { "set-supply-status", &cli_cmd_zcl_simple_metering_cluster_set_supply_status, false },
    { "set-uncntrl-flow-threshold", &cli_cmd_zcl_simple_metering_cluster_set_uncontrolled_flow_threshold, false },
    { NULL, NULL, false },
};

// ZCL cluster commands
static const sl_cli_command_info_t cli_cmd_basic_group = \
  SL_CLI_COMMAND_GROUP(zcl_basic_cluster_command_table, "ZCL basic cluster commands");
static const sl_cli_command_info_t cli_cmd_color_control_group = \
  SL_CLI_COMMAND_GROUP(zcl_color_control_cluster_command_table, "ZCL color_control cluster commands");
static const sl_cli_command_info_t cli_cmd_groups_group = \
  SL_CLI_COMMAND_GROUP(zcl_groups_cluster_command_table, "ZCL groups cluster commands");
static const sl_cli_command_info_t cli_cmd_ias_zone_group = \
  SL_CLI_COMMAND_GROUP(zcl_ias_zone_cluster_command_table, "ZCL ias_zone cluster commands");
static const sl_cli_command_info_t cli_cmd_identify_group = \
  SL_CLI_COMMAND_GROUP(zcl_identify_cluster_command_table, "ZCL identify cluster commands");
static const sl_cli_command_info_t cli_cmd_level_control_group = \
  SL_CLI_COMMAND_GROUP(zcl_level_control_cluster_command_table, "ZCL level_control cluster commands");
static const sl_cli_command_info_t cli_cmd_on_off_group = \
  SL_CLI_COMMAND_GROUP(zcl_on_off_cluster_command_table, "ZCL on_off cluster commands");
static const sl_cli_command_info_t cli_cmd_poll_control_group = \
  SL_CLI_COMMAND_GROUP(zcl_poll_control_cluster_command_table, "ZCL poll_control cluster commands");
static const sl_cli_command_info_t cli_cmd_power_profile_group = \
  SL_CLI_COMMAND_GROUP(zcl_power_profile_cluster_command_table, "ZCL power_profile cluster commands");
static const sl_cli_command_info_t cli_cmd_scenes_group = \
  SL_CLI_COMMAND_GROUP(zcl_scenes_cluster_command_table, "ZCL scenes cluster commands");
static const sl_cli_command_info_t cli_cmd_simple_metering_group = \
  SL_CLI_COMMAND_GROUP(zcl_simple_metering_cluster_command_table, "ZCL simple_metering cluster commands");

static const sl_cli_command_entry_t zcl_group_table[] = {
  { "basic", &cli_cmd_basic_group, false },
  { "color-control", &cli_cmd_color_control_group, false },
  { "groups", &cli_cmd_groups_group, false },
  { "ias-zone", &cli_cmd_ias_zone_group, false },
  { "identify", &cli_cmd_identify_group, false },
  { "level-control", &cli_cmd_level_control_group, false },
  { "on-off", &cli_cmd_on_off_group, false },
  { "poll-control", &cli_cmd_poll_control_group, false },
  { "power-profile", &cli_cmd_power_profile_group, false },
  { "scenes", &cli_cmd_scenes_group, false },
  { "simple-metering", &cli_cmd_simple_metering_group, false },
  { "global", &cli_cmd_zcl_global_group, false },
  { "mfg-code", &cli_cmd_zcl_mfg_code_command, false},
  { "time", &cli_cmd_zcl_time_command, false},
  { "use-next-sequence", &cli_cmd_zcl_use_next_sequence_command, false},
  { "x-default-resp", &cli_cmd_zcl_x_default_resp_command, false},
  { "test-response-on", &cli_cmd_zcl_test_response_on_command, false},
  { "test-response-off", &cli_cmd_zcl_test_response_off_command, false},
  { NULL, NULL, false },
};

