thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
sl_cli_command_info_t cli_cmd_zcl_group = \
  SL_CLI_COMMAND_GROUP(zcl_group_table, "ZCL commands");

// Create root command table
const sl_cli_command_entry_t sl_cli_zcl_command_table[] = {
  { "zcl", &cli_cmd_zcl_group, false },
  { NULL, NULL, false },
};

sl_cli_command_group_t sl_cli_zcl_command_group =
{
  { NULL },
  false,
  sl_cli_zcl_command_table
};


WEAK(void sli_zigbee_cli_zcl_groups_add_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_STRING
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_GROUPS_CLUSTER_ID,                                                       \
    0, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_groups_add_if_id_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_STRING
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_GROUPS_CLUSTER_ID,                                                       \
    5, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_scenes_add_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[5] =  { 
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_STRING,
    SL_ZCL_CLI_ARG_HEXOPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SCENES_CLUSTER_ID,                                                       \
    0, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_chg_supply_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[6] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    11, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_color_control_loop_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[7] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8OPT,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_COLOR_CONTROL_CLUSTER_ID,                                                       \
    68, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_cfg_mirror_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[4] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT24,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    8, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_cfg_nft_flags_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[7] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    10, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_cfg_nft_scheme_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[3] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT32
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    9, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_scenes_copy_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[5] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SCENES_CLUSTER_ID,                                                       \
    66, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_identify_ez_mode_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[1] =  { 
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_IDENTIFY_CLUSTER_ID,                                                       \
    2, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_power_profile_energy_phases_schedule_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[3] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_HEXOPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_POWER_PROFILE_CLUSTER_ID,                                                       \
    4, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_power_profile_energy_phases_schedule_states_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[1] =  { 
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_POWER_PROFILE_CLUSTER_ID,                                                       \
    7, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_scenes_eadd_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[5] =  { 
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_STRING,
    SL_ZCL_CLI_ARG_HEXOPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SCENES_CLUSTER_ID,                                                       \
    64, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_color_control_emovehue_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[4] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8OPT,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_COLOR_CONTROL_CLUSTER_ID,                                                       \
    65, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_color_control_emovetohue_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[5] =  { 
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8OPT,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_COLOR_CONTROL_CLUSTER_ID,                                                       \
    64, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_color_control_emovetohueandsat_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[5] =  { 
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8OPT,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_COLOR_CONTROL_CLUSTER_ID,                                                       \
    67, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_color_control_estephue_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[5] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8OPT,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_COLOR_CONTROL_CLUSTER_ID,                                                       \
    66, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_scenes_eview_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SCENES_CLUSTER_ID,                                                       \
    65, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_poll_control_stop_command(sl_cli_command_arg_t *arguments)) {
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_POLL_CONTROL_CLUSTER_ID,                                                       \
    1, \
    arguments, \
    NULL);
}

WEAK(void sli_zigbee_cli_zcl_groups_get_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_GROUPS_CLUSTER_ID,                                                       \
    2, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_get_ntfy_msg_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[3] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT32
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    11, \
    arguments, \
    argumentTypes);
}

