thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/zap-cli.c
WEAK(void sli_zigbee_cli_zcl_color_control_movetohue_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[5] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8OPT,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_COLOR_CONTROL_CLUSTER_ID,                                                       \
    0, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_color_control_movetohueandsat_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[5] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8OPT,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_COLOR_CONTROL_CLUSTER_ID,                                                       \
    6, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_level_control_mv_to_level_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[4] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8OPT,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_LEVEL_CONTROL_CLUSTER_ID,                                                       \
    0, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_level_control_o_mv_to_level_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_LEVEL_CONTROL_CLUSTER_ID,                                                       \
    4, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_color_control_movetosat_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[4] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8OPT,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_COLOR_CONTROL_CLUSTER_ID,                                                       \
    3, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_level_control_o_move_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_LEVEL_CONTROL_CLUSTER_ID,                                                       \
    5, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_on_off_off_command(sl_cli_command_arg_t *arguments)) {
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_ON_OFF_CLUSTER_ID,                                                       \
    0, \
    arguments, \
    NULL);
}

WEAK(void sli_zigbee_cli_zcl_on_off_offeffect_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_ON_OFF_CLUSTER_ID,                                                       \
    64, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_on_off_on_command(sl_cli_command_arg_t *arguments)) {
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_ON_OFF_CLUSTER_ID,                                                       \
    1, \
    arguments, \
    NULL);
}

WEAK(void sli_zigbee_cli_zcl_on_off_onrecall_command(sl_cli_command_arg_t *arguments)) {
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_ON_OFF_CLUSTER_ID,                                                       \
    65, \
    arguments, \
    NULL);
}

WEAK(void sli_zigbee_cli_zcl_on_off_ontimedoff_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[3] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT16
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_ON_OFF_CLUSTER_ID,                                                       \
    66, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_power_profile_profile_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[1] =  { 
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_POWER_PROFILE_CLUSTER_ID,                                                       \
    0, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_power_profile_schedule_constraints_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[1] =  { 
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_POWER_PROFILE_CLUSTER_ID,                                                       \
    6, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_power_profile_state_command(sl_cli_command_arg_t *arguments)) {
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_POWER_PROFILE_CLUSTER_ID,                                                       \
    1, \
    arguments, \
    NULL);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_pub_ss_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[8] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    6, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_scenes_recall_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[3] =  { 
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16OPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SCENES_CLUSTER_ID,                                                       \
    5, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_groups_rmall_command(sl_cli_command_arg_t *arguments)) {
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_GROUPS_CLUSTER_ID,                                                       \
    4, \
    arguments, \
    NULL);
}

WEAK(void sli_zigbee_cli_zcl_scenes_rmall_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[1] =  { 
    SL_ZCL_CLI_ARG_UINT16
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SCENES_CLUSTER_ID,                                                       \
    3, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_groups_remove_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[1] =  { 
    SL_ZCL_CLI_ARG_UINT16
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_GROUPS_CLUSTER_ID,                                                       \
    3, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_remove_mirror_command(sl_cli_command_arg_t *arguments)) {
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    2, \
    arguments, \
    NULL);
}

WEAK(void sli_zigbee_cli_zcl_scenes_remove_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SCENES_CLUSTER_ID,                                                       \
    2, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_req_fast_poll_mode_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    3, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_request_mirror_command(sl_cli_command_arg_t *arguments)) {
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    1, \
    arguments, \
    NULL);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_rst_load_limit_ctr_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT32
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    10, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_basic_rtfd_command(sl_cli_command_arg_t *arguments)) {
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_BASIC_CLUSTER_ID,                                                       \
    0, \
    arguments, \
    NULL);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_sch_snapshot_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[4] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_HEXOPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    4, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_sch_snapshot_resp_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[2] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_HEXOPT
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    4, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_poll_control_long_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[1] =  { 
    SL_ZCL_CLI_ARG_UINT32
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_POLL_CONTROL_CLUSTER_ID,                                                       \
    2, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_poll_control_short_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[1] =  { 
    SL_ZCL_CLI_ARG_UINT16
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_POLL_CONTROL_CLUSTER_ID,                                                       \
    3, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_set_supply_status_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[5] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT8
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    13, \
    arguments, \
    argumentTypes);
}

WEAK(void sli_zigbee_cli_zcl_simple_metering_set_uncntrl_flow_threshold_command(sl_cli_command_arg_t *arguments)) {
  uint8_t argumentTypes[8] =  { 
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT32,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT16,
    SL_ZCL_CLI_ARG_UINT8,
    SL_ZCL_CLI_ARG_UINT16
  }; 
  sli_zigbee_zcl_simple_command(
    ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER,  \
    ZCL_SIMPLE_METERING_CLUSTER_ID,                                                       \
    14, \
    arguments, \
    argumentTypes);
}

